/*
================================================

نام فایل:
BaseEntity.kt

ماژول:
Core Engine

وظیفه:
کلاس پایه برای موجودیت های اصلی سیستم.

هدف:
تمام اطلاعات پایه موجودیت های مختلف مانند مشتری، کالا و فاکتور می توانند از این ساختار استفاده کنند.

این فایل نباید شامل منطق مربوط به کسب و کار خاص باشد.

================================================
*/

package com.wstoremgdata.core.entity

/**
 * موجودیت پایه سیستم.
 *
 * شناسه عمومی برای تمام داده های اصلی برنامه.
 */
open class BaseEntity(
    val id: String
)
