package com.wstore.engine.data.database

/*
====================================================
نام فایل: AppDatabase.kt

وظیفه:
تعریف نقطه اتصال دیتابیس برنامه.

این فایل متعلق به لایه Data است و هیچ اطلاعاتی از نوع کسب و کار ندارد.

مواردی مثل موبایل، بوتیک، سالن یا هر کسب و کار دیگر
نباید در این لایه قرار بگیرد.

داده ها توسط Core و Business Profile مدیریت می شوند.
====================================================
*/

// در مرحله بعد با Room Database تکمیل می شود.
// این ساختار برای آماده سازی معماری دیتابیس ایجاد شده است.
class AppDatabase
